output/visualizations/query_workflow.mmd
%% 查询工作流
%% Generated by Medical-Graph-RAG Visualization Module
---
config:
  flowchart:
    curve: linear
---
graph TD;
	__start__([<p>__start__</p>]):::first
	analyze_query(analyze_query)
	retrieve(retrieve)
	generate_answer(generate_answer)
	__end__([<p>__end__</p>]):::last
	__start__ --> analyze_query;
	analyze_query -. &nbsp;simple&nbsp; .-> generate_answer;
	analyze_query -.-> retrieve;
	retrieve --> generate_answer;
	generate_answer --> __end__;
	classDef default fill:#f2f0ff,line-height:1.2
	classDef first fill-opacity:0
	classDef last fill:#bfb6fc
